Revit 2024 API
TableSectionData.InsertImage Method
 Inserts a image in the given cell.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void InsertImage(
	int nRow,
	int nColumn,
	ElementId imageSymbolId
)
Visual Basic
Public Sub InsertImage ( _
	nRow As Integer, _
	nColumn As Integer, _
	imageSymbolId As ElementId _
)
Visual C++
public:
void InsertImage(
	int nRow,
	int nColumn,
	ElementId^ imageSymbolId
)
Parameters
nRow
Type: System.Int32
 The given row index.
nColumn
Type: System.Int32
 The given column index.
imageSymbolId
Type: Autodesk.Revit.DB.ElementId
 The element id of the image symbol.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number nRow is invalid. -or- The given column number nColumn is invalid. -or- The image symbol id doesn't represent a valid image symbol element.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace